Revit 2027 API
ACADExportOptions.FileVersion Property
 ACADVersion::Default Default value is ACADVersion.Default.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ACADVersion FileVersion { get; set; }
Public Property FileVersion As ACADVersion
	Get
	Set
public:
property ACADVersion FileVersion {
	ACADVersion get ();
	void set (ACADVersion value);
}
member FileVersion : ACADVersion with get, set
Property Value
ACADVersion
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ACADExportOptions Class
Autodesk.Revit.DB Namespace